# ContourSetting Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ContourSetting Class
Members See Also
---
Contour setting object that handles the contour information used to draw contours on elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public class ContourSetting : IDisposable
```

Visual Basic
---
```text
Public Class ContourSetting _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ContourSetting : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ContourSetting
# See Also
ContourSetting Members
Autodesk.Revit.DB Namespace